app/controllers/carts_controller.rb

  def checkout
    cart = Cart.find(params[:id])
    @order = Order.create_from_cart(cart)
---
SELECT  "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT 1  [["id", 26]]
INSERT INTO "orders" ("cart_id", "total", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["cart_id", 26], ["total", 6997], ["created_at", "2015-07-01 16:20:33.939859"], ["updated_at", "2015-07-01 16:20:33.939859"]]