app/controllers/line_items_controller.rb

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", 5]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2015-07-01 16:20:32.379405"], ["updated_at", "2015-07-01 16:20:32.379405"]]
INSERT INTO "line_items" ("item_id", "cart_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["item_id", 5], ["cart_id", 6], ["created_at", "2015-07-01 16:20:32.436726"], ["updated_at", "2015-07-01 16:20:32.436726"]]
UPDATE "line_items" SET "quantity" = ?, "updated_at" = ? WHERE "line_items"."id" = ?  [["quantity", 2], ["updated_at", "2015-07-01 16:20:33.201826"], ["id", 2]]
---
  def create
    initialize_cart
    item = Item.find(params[:item_id])
    @line_item = current_cart.add_item(item.id)

    if @line_item.save