app/controllers/store_controller.rb

SELECT "categories".* FROM "categories"  ORDER BY "categories"."title" ASC
SELECT "items".* FROM "items"  ORDER BY "items"."title" ASC
---
  def index
    @categories = Category.order(:title)
    @items = Item.order(:title)